HomeWork-3/reports/local-withIndex-wrk2-R400.txt
Running 1m test @ http://localhost:5000
  8 threads and 100 connections
  Thread calibration: mean lat.: 4148.590ms, rate sampling interval: 14598ms
  Thread calibration: mean lat.: 3904.393ms, rate sampling interval: 14819ms
  Thread calibration: mean lat.: 4446.958ms, rate sampling interval: 15163ms
  Thread calibration: mean lat.: 3994.945ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 4582.528ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 4084.001ms, rate sampling interval: 15745ms
  Thread calibration: mean lat.: 4817.385ms, rate sampling interval: 14581ms
  Thread calibration: mean lat.: 4722.722ms, rate sampling interval: 16179ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.99s    13.01s    0.90m    56.91%
    Req/Sec     5.50      0.91     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.65s 
 75.000%   42.40s 
 90.000%   48.27s 
 99.000%    0.87m 
 99.900%    0.90m 
 99.990%    0.90m 
 99.999%    0.90m 
100.000%    0.90m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6934.527     0.000000            1         1.00
   11993.087     0.100000          242         1.11
   16973.823     0.200000          484         1.25
   23592.959     0.300000          726         1.43
   27164.671     0.400000          968         1.67
   31653.887     0.500000         1209         2.00
   33751.039     0.550000         1331         2.22
   35454.975     0.600000         1451         2.50
   38305.791     0.650000         1572         2.86
   40271.871     0.700000         1693         3.33
   42401.791     0.750000         1814         4.00
   43548.671     0.775000         1874         4.44
   44531.711     0.800000         1935         5.00
   45383.679     0.825000         1995         5.71
   46301.183     0.850000         2056         6.67
   47316.991     0.875000         2117         8.00
   47972.351     0.887500         2147         8.89
   48267.263     0.900000         2178        10.00
   48693.247     0.912500         2207        11.43
   49086.463     0.925000         2237        13.33
   49577.983     0.937500         2267        16.00
   49807.359     0.943750         2284        17.78
   50102.271     0.950000         2298        20.00
   50331.647     0.956250         2313        22.86
   50626.559     0.962500         2328        26.67
   51019.775     0.968750         2344        32.00
   51118.079     0.971875         2351        35.56
   51281.919     0.975000         2358        40.00
   51445.759     0.978125         2366        45.71
   51576.831     0.981250         2373        53.33
   51838.975     0.984375         2383        64.00
   51904.511     0.985938         2384        71.11
   52035.583     0.987500         2388        80.00
   52232.191     0.989062         2392        91.43
   52330.495     0.990625         2396       106.67
   52690.943     0.992188         2400       128.00
   52723.711     0.992969         2402       142.22
   52789.247     0.993750         2404       160.00
   52854.783     0.994531         2405       182.86
   53051.391     0.995313         2407       213.33
   53116.927     0.996094         2409       256.00
   53280.767     0.996484         2413       284.44
   53280.767     0.996875         2413       320.00
   53280.767     0.997266         2413       365.71
   53280.767     0.997656         2413       426.67
   53477.375     0.998047         2414       512.00
   53477.375     0.998242         2414       568.89
   53542.911     0.998437         2415       640.00
   53542.911     0.998633         2415       731.43
   53936.127     0.998828         2416       853.33
   53936.127     0.999023         2416      1024.00
   53936.127     0.999121         2416      1137.78
   54034.431     0.999219         2417      1280.00
   54034.431     0.999316         2417      1462.86
   54034.431     0.999414         2417      1706.67
   54034.431     0.999512         2417      2048.00
   54034.431     0.999561         2417      2275.56
   54099.967     0.999609         2418      2560.00
   54099.967     1.000000         2418          inf
#[Mean    =    30988.675, StdDeviation   =    13010.672]
#[Max     =    54067.200, Total count    =         2418]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.13s 
 75.000%    3.31s 
 90.000%    5.31s 
 99.000%    8.61s 
 99.900%   15.18s 
 99.990%   19.76s 
 99.999%   19.76s 
100.000%   19.76s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.167     0.000000            1         1.00
      26.111     0.100000          242         1.11
      45.631     0.200000          484         1.25
      82.431     0.300000          726         1.43
     422.143     0.400000          968         1.67
    1134.591     0.500000         1209         2.00
    1530.879     0.550000         1330         2.22
    1886.207     0.600000         1451         2.50
    2275.327     0.650000         1573         2.86
    2744.319     0.700000         1693         3.33
    3313.663     0.750000         1814         4.00
    3551.231     0.775000         1874         4.44
    3878.911     0.800000         1935         5.00
    4175.871     0.825000         1995         5.71
    4530.175     0.850000         2057         6.67
    4919.295     0.875000         2116         8.00
    5152.767     0.887500         2146         8.89
    5312.511     0.900000         2177        10.00
    5558.271     0.912500         2207        11.43
    5718.015     0.925000         2237        13.33
    6021.119     0.937500         2267        16.00
    6176.767     0.943750         2282        17.78
    6377.471     0.950000         2298        20.00
    6541.311     0.956250         2313        22.86
    6791.167     0.962500         2328        26.67
    6975.487     0.968750         2343        32.00
    7069.695     0.971875         2350        35.56
    7192.575     0.975000         2359        40.00
    7356.415     0.978125         2366        45.71
    7626.751     0.981250         2373        53.33
    7974.911     0.984375         2381        64.00
    8286.207     0.985938         2384        71.11
    8404.991     0.987500         2388        80.00
    8568.831     0.989062         2392        91.43
    8650.751     0.990625         2396       106.67
    8740.863     0.992188         2400       128.00
    8839.167     0.992969         2401       142.22
    9215.999     0.993750         2403       160.00
    9322.495     0.994531         2405       182.86
    9887.743     0.995313         2407       213.33
   10461.183     0.996094         2409       256.00
   10969.087     0.996484         2410       284.44
   11042.815     0.996875         2411       320.00
   11493.375     0.997266         2412       365.71
   11583.487     0.997656         2413       426.67
   12754.943     0.998047         2414       512.00
   12754.943     0.998242         2414       568.89
   13197.311     0.998437         2415       640.00
   13197.311     0.998633         2415       731.43
   15179.775     0.998828         2416       853.33
   15179.775     0.999023         2416      1024.00
   15179.775     0.999121         2416      1137.78
   16842.751     0.999219         2417      1280.00
   16842.751     0.999316         2417      1462.86
   16842.751     0.999414         2417      1706.67
   16842.751     0.999512         2417      2048.00
   16842.751     0.999561         2417      2275.56
   19759.103     0.999609         2418      2560.00
   19759.103     1.000000         2418          inf
#[Mean    =     1956.564, StdDeviation   =     2279.071]
#[Max     =    19742.720, Total count    =         2418]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3169 requests in 1.00m, 1.87MB read
Requests/sec:     52.75
Transfer/sec:     31.81KB